app/Http/Controllers/Api/V1/Student/StudentController.php

    public function index(StudentFilterRequest $request)
    {
        $query = Student::with('selectionBatch');

        $query->when($request->filled('status'), fn($q) => $q->where('enrollment_status', $request->status));

        $query->when($request->filled('batch'), fn($q) => $q->where('selection_batch_id', $request->batch));

        $query->when($request->filled('province'), fn($q) => $q->where('province', 'like', '%' . $request->province . '%'));

        $query->when($request->filled('search'), function ($q) use ($request) {
            $searchTerm = '%' . $request->search . '%';
            $q->where(function ($subQuery) use ($searchTerm) {
                $subQuery->where('student_id_no', 'like', $searchTerm)
                    ->orWhere('full_name', 'like', $searchTerm)
                    ->orWhere('phone', 'like', $searchTerm)
                    ->orWhere('email', 'like', $searchTerm);
            });
        });

        $students = $query->orderBy('created_at', 'desc')->paginate(15);
---
select * from `selection_batches` where `selection_batches`.`id` in (1)
select * from `students` where `enrollment_status` = 'Enrolled' and `selection_batch_id` = '1' order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `students` where `enrollment_status` = 'Enrolled' and `selection_batch_id` = '1'