app/Http/Controllers/Api/V1/Concerns/AuditableLogger.php

    protected function logAudit($auditable, string $event, Request $request, array $oldValues = [], array $newValues = [])
    {
        AuditLog::create([
            'user_id' => auth()->id(),
            'event' => $event,
            'auditable_type' => $auditable::class,
            'auditable_id' => $auditable->id,
            'old_values' => $oldValues,
            'new_values' => !empty($newValues) ? $newValues : $auditable->toArray(),
            'ip_address' => $request->ip(),
            'user_agent' => $request->userAgent(),
            'url' => $request->url(),
            'method' => $request->method(),
        ]);
---
insert into `audit_logs` (`user_id`, `event`, `auditable_type`, `auditable_id`, `old_values`, `new_values`, `ip_address`, `user_agent`, `url`, `method`, `updated_at`, `created_at`) values (1, 'role_created', 'App\\Models\\Role', 7, '[]', '{\"name\":\"One\",\"slug\":\"one\",\"description\":\"view\",\"updated_at\":\"2026-07-10T03:31:48.000000Z\",\"created_at\":\"2026-07-10T03:31:48.000000Z\",\"id\":7}', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/150.0.0.0 Safari/537.36', 'http://127.0.0.1:8000/api/v1/roles', 'POST', '2026-07-10 03:31:48', '2026-07-10 03:31:48')

    protected function logUserAudit(User $user, string $event, Request $request)
    {
        $newValues = match ($event) {
            'login' => ['last_login_at' => now()],
            'logout' => ['logged_out_at' => now()],
            'token_refresh' => ['refreshed_at' => now()],
            'password_reset' => ['password_changed' => true],
            default => [],
        };

        AuditLog::create([
            'user_id' => $user->id,
            'event' => $event,
            'auditable_type' => User::class,
            'auditable_id' => $user->id,
            'new_values' => $newValues,
            'ip_address' => $request->ip(),
            'user_agent' => $request->userAgent(),
            'url' => $request->url(),
            'method' => $request->method(),
        ]);
---
insert into `audit_logs` (`user_id`, `event`, `auditable_type`, `auditable_id`, `new_values`, `ip_address`, `user_agent`, `url`, `method`, `updated_at`, `created_at`) values (1, 'login', 'App\\Models\\User', 1, '{\"last_login_at\":\"2026-07-13T01:35:20.630407Z\"}', '127.0.0.1', 'PostmanRuntime/7.54.0', 'http://127.0.0.1:8000/api/v1/auth/login', 'POST', '2026-07-13 01:35:20', '2026-07-13 01:35:20')