app/Observers/RoleObserver.php

insert into `audit_logs` (`user_id`, `event`, `auditable_type`, `auditable_id`, `old_values`, `new_values`, `ip_address`, `user_agent`, `url`, `method`, `updated_at`, `created_at`) values (1, 'role_created', 'App\\Models\\Role', 7, null, '{\"name\":\"One\",\"slug\":\"one\",\"description\":\"view\",\"updated_at\":\"2026-07-10T03:31:48.000000Z\",\"created_at\":\"2026-07-10T03:31:48.000000Z\",\"id\":7}', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/150.0.0.0 Safari/537.36', 'http://127.0.0.1:8000/api/v1/roles', 'POST', '2026-07-10 03:31:48', '2026-07-10 03:31:48')
---
    public function updated(Role $role): void
    {
        AuditLog::create([
            'user_id'        => Auth::id(),
            'event'          => 'role_updated',
            'auditable_type' => Role::class,
            'auditable_id'   => $role->id,
            'old_values'     => $role->getOriginal(),
            'new_values'     => $role->getChanges(),
            'ip_address'     => $this->request->ip(),
            'user_agent'     => $this->request->userAgent(),
            'url'            => $this->request->fullUrl(),
            'method'         => $this->request->method(),
        ]);