app/Services/Student/ImportValidationService.php

select `student_id_no` from `students`
select `id` from `selection_batches`
---
    private function loadExistingData(): void
    {
        $this->existingStudentIds = Student::pluck('student_id_no')->toArray();
        $this->existingBatchIds = SelectionBatch::pluck('id')->toArray();