app/Services/Student/StudentImportService.php

insert into `import_logs` (`file_name`, `imported_by`, `total_rows`, `success_count`, `error_count`, `status`, `updated_at`, `created_at`) values ('students.csv', 1, 2, 0, 2, 'Processing', '2026-07-13 03:41:19', '2026-07-13 03:41:19')
---
    private function createImportLog(string $fileName, int $userId, array $summary): ImportLog
    {
        return ImportLog::create([
            'file_name' => $fileName,
            'imported_by' => $userId,
            'total_rows' => $summary['total'],
            'success_count' => 0,
            'error_count' => $summary['invalid'],
            'status' => 'Processing',
        ]);

insert into `students` (`student_id_no`, `full_name`, `gender`, `dob`, `phone`, `email`, `province`, `high_school`, `selection_batch_id`, `enrollment_status`, `intake_year`, `created_by`, `photo_path`, `updated_at`, `created_at`) values ('ST0012', 'Sokny Nim', 'Male', '2000-01-15', '0123456789', 'sokny@example.com', 'Takeo', 'Russey Keo High School', 1, 'Enrolled', 2024, 1, null, '2026-07-13 03:46:47', '2026-07-13 03:46:47')
---
    private function importSingleRow(array $row, int $userId): bool
    {
        try {
            Student::create($this->buildStudentData($row, $userId));

insert into `import_errors` (`error_message`, `field`, `import_log_id`, `row_number`) values ('student_id_no: Student ID already exists.', 'student_id_no', 4, 1), ('student_id_no: Student ID already exists.', 'student_id_no', 4, 2)
---
    private function logValidationErrors(int $importLogId, array $invalidRows): void
    {
        $errorRecords = $this->buildErrorRecords($importLogId, $invalidRows);

        if (!empty($errorRecords)) {
            ImportError::insert($errorRecords);