app/Http/Controllers/Api/V1/AuthController.php

    public function login(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'email' => 'required|email',
            'password' => 'required|string',
        ]);

        if ($validator->fails()) {
            return $this->error('Validation failed', 422, $validator->errors());
        }

        $user = User::where('email', $request->email)->first();

        if (!$user || !Hash::check($request->password, $user->password)) {
            return $this->error('Invalid credentials', 401);
        }

        if (!$user->is_active) {
            return $this->error('Account is inactive', 401);
        }

        $user->update(['last_login_at' => now()]);
---
select * from `users` where `email` = 'admin@pnc.edu.kh' limit 1
update `users` set `last_login_at` = '2026-07-11 13:33:06', `users`.`updated_at` = '2026-07-11 13:33:06' where `id` = 1

            'refresh_token' => $refreshToken,
            'token_type' => 'bearer',
            'expires_in' => (int) config('jwt.ttl') * 60,
            'permissions' => $user->role?->permissions->pluck('slug')->toArray() ?? [],
---
select `permissions`.*, `role_permission`.`role_id` as `pivot_role_id`, `role_permission`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_permission` on `permissions`.`id` = `role_permission`.`permission_id` where `role_permission`.`role_id` = 1

    public function me(Request $request)
    {
        try {
            $user = JWTAuth::user();

            if (!$user) {
                return $this->error('User not found', 404);
            }

            return response()->json([
                'status' => 'success',
                'message' => 'User data retrieved successfully',
                'user' => [
                    'id' => $user->id,
                    'name' => $user->name,
                    'email' => $user->email,
                    'role' => $user->role?->slug,
                ],
                'permissions' => $user->role?->permissions->pluck('slug')->toArray() ?? [],
            ], 200);
---
select `permissions`.*, `role_permission`.`role_id` as `pivot_role_id`, `role_permission`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_permission` on `permissions`.`id` = `role_permission`.`permission_id` where `role_permission`.`role_id` = 1
select `permissions`.*, `role_permission`.`role_id` as `pivot_role_id`, `role_permission`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_permission` on `permissions`.`id` = `role_permission`.`permission_id` where `role_permission`.`role_id` = 2

    public function requestReset(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'email' => 'required|email',
        ]);

        if ($validator->fails()) {
            return $this->error('Validation failed', 422, $validator->errors());
        }

        $user = User::where('email', $request->email)->first();

        if (!$user) {
            return response()->json([
                'status' => 'success',
                'message' => 'If the email exists, a reset token has been sent',
            ], 200);
        }

        $token = Str::random(60);

        DB::table('password_resets')->insert([
            'email' => $user->email,
            'token' => $token,
            'created_at' => now(),
        ]);
---
select * from `users` where `email` = 'admin@pnc.edu.kh' limit 1
insert into `password_resets` (`email`, `token`, `created_at`) values ('admin@pnc.edu.kh', 'gk50ff8SRgs6onlIwZOND9KBy9lDl9cwvfSghZfobyYYadQ8F3Vcfl6aCsdk', '2026-07-13 06:51:10')

    public function confirmReset(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'email' => 'required|email',
            'reset_token' => 'required|string',
            'password' => 'required|string|min:8|confirmed',
        ]);

        if ($validator->fails()) {
            return $this->error('Validation failed', 422, $validator->errors());
        }

        $resetRow = DB::table('password_resets')
            ->where('email', $request->email)
            ->where('token', $request->reset_token)
            ->first();

        if (!$resetRow) {
            return $this->error('Invalid or expired reset token', 400);
        }

        // Expire after 1 hour (matches your previous logic)
        if ($resetRow->created_at === null || now()->diffInSeconds($resetRow->created_at) > 3600) {
            return $this->error('Invalid or expired reset token', 400);
        }

        $user = User::where('email', $request->email)->first();
---
select * from `users` where `email` = 'admin@pnc.edu.kh' limit 1

            return $this->error('Invalid or expired reset token', 400);
        }

        $user->update(['password' => Hash::make($request->password)]);

        DB::table('password_resets')
            ->where('email', $request->email)
            ->where('token', $request->reset_token)
            ->delete();
---
update `users` set `password` = '$2y$12$Fj0BbDiKi1fZVOOadUn0IOz/EIiyAelgP4A5VlyELR5u0ixss/MUy', `users`.`updated_at` = '2026-07-13 06:51:53' where `id` = 1
delete from `password_resets` where `email` = 'admin@pnc.edu.kh' and `token` = 'gk50ff8SRgs6onlIwZOND9KBy9lDl9cwvfSghZfobyYYadQ8F3Vcfl6aCsdk'
select * from `password_resets` where `email` = 'admin@pnc.edu.kh' and `token` = 'gk50ff8SRgs6onlIwZOND9KBy9lDl9cwvfSghZfobyYYadQ8F3Vcfl6aCsdk' limit 1

    private function generateRefreshToken(User $user): string
    {
        $token = hash('sha256', $user->id . now()->timestamp . random_bytes(32));

        DB::table('refresh_tokens')->insert([
            'user_id' => $user->id,
            'token' => $token,
            'expires_at' => now()->addMinutes((int) config('jwt.refresh_ttl')),
            'created_at' => now(),
            'updated_at' => now(),
        ]);
---
insert into `refresh_tokens` (`user_id`, `token`, `expires_at`, `created_at`, `updated_at`) values (1, '858a8c60c5d7884c28aff2cf7183d88671bb95953960243eeb302f0c3c7b0e6b', '2026-07-18 13:33:06', '2026-07-11 13:33:06', '2026-07-11 13:33:06')