app/Http/Controllers/Api/V1/RoleController.php

insert into `roles` (`name`, `slug`, `description`, `updated_at`, `created_at`) values ('One', 'one', 'view', '2026-07-10 03:31:48', '2026-07-10 03:31:48')
select * from `role_permission` where `role_permission`.`role_id` = 7
select `id` from `permissions` where `slug` in ('students.view')
insert into `role_permission` (`permission_id`, `role_id`) values (5, 7)
---
    public function store(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'name' => 'required|string|max:255',
            'slug' => 'nullable|string|max:255|unique:roles,slug',
            'description' => 'nullable|string',
            'permissions' => 'nullable|array',
            'permissions.*' => 'string|exists:permissions,slug',
        ]);

        if ($validator->fails()) {
            return $this->error('Validation failed', 422, $validator->errors()->toArray());
        }

        $role = Role::create([
            'name' => $request->name,
            'slug' => $request->slug ?? \Illuminate\Support\Str::slug($request->name),
            'description' => $request->description,
        ]);

        if ($request->exists('permissions')) {
            $permissionIds = Permission::whereIn('slug', $request->permissions)->pluck('id');
            $role->permissions()->sync($permissionIds);

select `permissions`.*, `role_permission`.`role_id` as `pivot_role_id`, `role_permission`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_permission` on `permissions`.`id` = `role_permission`.`permission_id` where `role_permission`.`role_id` in (7)
---
            [
                'status' => 'success',
                'message' => 'Role created successfully',
                'data' => $role->load('permissions'),

select `permissions`.*, `role_permission`.`role_id` as `pivot_role_id`, `role_permission`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_permission` on `permissions`.`id` = `role_permission`.`permission_id` where `role_permission`.`role_id` in (1, 2, 3, 4, 5, 6)
---
    public function index(Request $request)
    {
        return response()->json(
            [
                'status' => 'success',
                'message' => 'Roles retrieved successfully',
                'data' => Role::with('permissions')->withCount('users')->get(),