app/Http/Controllers/Api/V1/UserController.php

    public function index(Request $request)
    {
        return response()->json([
            'status' => 'success',
            'message' => 'Users retrieved successfully',
            'data' => User::with('role')->paginate(15),
---
select * from `roles` where `roles`.`id` in (1, 2, 3)
select * from `users` limit 15 offset 0
select count(*) as aggregate from `users`

    public function store(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'name' => 'required|string|max:255',
            'email' => 'required|string|email|max:255|unique:users',
            'password' => 'required|string|min:8',
            'role_id' => 'nullable|exists:roles,id',
            'is_active' => 'boolean',
        ]);

        if ($validator->fails()) {
            return $this->error('Validation failed', 422, $validator->errors());
        }

        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
            'role_id' => $request->role_id,
            'is_active' => $request->is_active ?? true,
        ]);

        $this->logAudit($user, 'user_created', $request, [], $user->toArray());

        return response()->json([
            'status' => 'success',
            'message' => 'User created successfully',
            'data' => $user->load('role'),
---
insert into `users` (`name`, `email`, `password`, `role_id`, `is_active`, `updated_at`, `created_at`) values ('ny', 'ny@gmail.com', '$2y$12$OEHNJj9wujl4V/7aDhz3t.tinheCL7OMTw4FvOMjw/yxBJ5t0Cf8e', 7, 1, '2026-07-10 03:32:50', '2026-07-10 03:32:50')
select * from `roles` where `roles`.`id` in (7)

    public function destroy($id)
    {
        $user = User::find($id);

        if (!$user) {
            return $this->error('User not found', 404);
        }

        $userData = $user->toArray();
        $user->delete();
---
select * from `users` where `users`.`id` = '6' limit 1
delete from `users` where `id` = 6