app/Http/Controllers/Api/V1/Auth/AuthController.php

select * from `users` where `email` = 'admin@pnc.edu.kh' limit 1
update `users` set `last_login_at` = '2026-07-13 01:35:20', `users`.`updated_at` = '2026-07-13 01:35:20' where `id` = 1
---
    public function login(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'email' => 'required|email',
            'password' => 'required|string',
        ]);

        if ($validator->fails()) {
            return $this->error('Validation failed', 422, $validator->errors());
        }

        $user = User::where('email', $request->email)->first();

        if (!$user || !Hash::check($request->password, $user->password)) {
            return $this->error('Invalid credentials', 401);
        }

        if (!$user->is_active) {
            return $this->error('Account is inactive', 401);
        }

        $user->update(['last_login_at' => now()]);

select `permissions`.*, `role_permission`.`role_id` as `pivot_role_id`, `role_permission`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_permission` on `permissions`.`id` = `role_permission`.`permission_id` where `role_permission`.`role_id` = 1
---
            'refresh_token' => $refreshToken,
            'token_type' => 'bearer',
            'expires_in' => (int) config('jwt.ttl') * 60,
            'permissions' => $user->role?->permissions->pluck('slug')->toArray() ?? [],

insert into `refresh_tokens` (`user_id`, `token`, `expires_at`, `created_at`, `updated_at`) values (1, 'e2e819df70ed01f7ded787cd49edc410a939d2f867605269833e7dceeaf5dc89', '2026-07-20 01:35:20', '2026-07-13 01:35:20', '2026-07-13 01:35:20')
---
    private function generateRefreshToken(User $user): string
    {
        $token = hash('sha256', $user->id . now()->timestamp . random_bytes(32));

        DB::table('refresh_tokens')->insert([
            'user_id' => $user->id,
            'token' => $token,
            'expires_at' => now()->addMinutes((int) config('jwt.refresh_ttl')),
            'created_at' => now(),
            'updated_at' => now(),
        ]);