app/Http/Controllers/Api/V1/User/UserController.php

select * from `roles` where `roles`.`id` in (1, 2, 3)
select * from `users` limit 15 offset 0
select count(*) as aggregate from `users`
---
    public function index(Request $request)
    {
        return response()->json([
            'status' => 'success',
            'message' => 'Users retrieved successfully',
            'data' => User::with('role')->paginate(15),