app/Http/Controllers/Api/V1/Role/RoleController.php

select `permissions`.*, `role_permission`.`role_id` as `pivot_role_id`, `role_permission`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_permission` on `permissions`.`id` = `role_permission`.`permission_id` where `role_permission`.`role_id` in (1, 2, 3)
---
    public function index(Request $request)
    {
        return response()->json(
            [
                'status' => 'success',
                'message' => 'Roles retrieved successfully',
                'data' => Role::with('permissions')->withCount('users')->get(),